import { Settings, Users, BookOpen, Heart } from "lucide-react";
import teacher1Image from "../assets/teacher1.png";
import teacher2Image from "../assets/teacher2.png";
import kimhorngImage from "../assets/Kimhorng.png";
import moeunImage from "../assets/Moeun Kimhour.png";
import phearumImage from "../assets/Phearum.png";
import manethImage from "../assets/Maneth.png";
import chovornImage from "../assets/chovorn.jpg";
import lisaImage from "../assets/Lisa.png";
import philipImage from "../assets/Philip.png";
import vathImage from "../assets/Vath.png";

export const leaders = [
  {
    firstName: "អ្នកគ្រូ",
    highlight: "ស្រ៊ង",
    lastName: "សុខជាតិ",
    desc: "នៅពីក្រោយដំណើរការទាំងអស់គឺមានអ្នកគ្រូជាអ្នកដឹកនាំឆ្លាតវៃដែលបម្លែងប្រព័ន្ធBackendដ៏ស្មុគស្មាញឲ្យក្លាយទៅជាដំណើរការដែលរលូននិងមានប្រសិទ្ធភាព។",
    img: teacher1Image,
  },
  {
    firstName: "លោគគ្រូ",
    highlight: "គិត",
    lastName: "តារា",
    desc: "នៅពីក្រោយដំណើរការទាំងអស់គឺមានអ្នកគ្រូជាអ្នកដឹកនាំឆ្លាតវៃដែលបម្លែងប្រព័ន្ធBackendដ៏ស្មុគស្មាញឲ្យក្លាយទៅជាដំណើរការដែលរលូននិងមានប្រសិទ្ធភាព។",
    img: teacher2Image,
  },
];

export const members = [
  {
    name: "យ៉ាង គីមហ័ង",
    role: "ប្រធាន",
    img: kimhorngImage,
    quote: "ពេលនោះ ដាក់ធ្វើការលើនេះ",
  },
  {
    name: "មឿន គឹមហ៊ួ",
    role: "អនុប្រធាន",
    img: moeunImage,
    quote: "ពេលនោះ ដាក់ធ្វើការលើនេះ",
  },
  {
    name: "ជា​ ភីរម្យ",
    role: "សមាជិក",
    img: phearumImage,
    quote: "ពេលនោះ ដាក់ធ្វើការលើនេះ",
  },
  {
    name: "លាង​ ម៉ាណែត",
    role: "សមាជិក​",
    img: manethImage,
    quote: "ពេលនោះ ដាក់ធ្វើការលើនេះ",
  },
  {
    name: "ស៊ន ឆវ័ន",
    role: "សមាជិក",
    img: chovornImage,
    quote: "ពេលនោះ ដាក់ធ្វើការលើនេះ",
  },
  {
    name: "សារុន​ លីសា",
    role: "សមាជិក",
    img: lisaImage,
    quote: "ពេលនោះ ដាក់ធ្វើការលើនេះ",
  },
  {
    name: "ឆាន់ ហ្វីលីប",
    role: "សមាជិក",
    img: philipImage,
    quote: "ពេលនោះ ដាក់ធ្វើការលើនេះ",
  },
  {
    name: "កើត វ៉ាត់",
    role: "សមាជិក",
    img: vathImage,
    quote: "ពេលនោះ ដាក់ធ្វើការលើនេះ",
  },
];

export const features = [
  {
    title: "ភាពងាយស្រួលចូលប្រើប្រាស់",
    desc: "ការអប់រំបច្ចេកវិទ្យាគួរតែឥតគិតថ្លៃ និងអាចរកបានសម្រាប់មនុស្សគ្រប់គ្នា",
    icon: Settings, // ✅ replaced
  },
  {
    title: "សហគមន៍",
    desc: "យើងរួមគ្នាបង្កើតបរិយាកាសគាំទ្រសម្រាប់ការរៀនសូត្រ និងការរីកចម្រើន",
    icon: Users,
  },
  {
    title: "ការពង្រឹងសមត្ថភាព",
    desc: "យើងផ្តល់អំណាចដល់សិស្សានុសិស្សឱ្យកសាងអាជីពក្នុងវិស័យបច្ចេកវិទ្យា",
    icon: BookOpen,
  },
  {
    title: "គុណភាព",
    desc: "យើងផ្តល់ជូននូវខ្លឹមសារស្ដង់ដារដែលបង្រៀនដោយអ្នកជំនាញមានបទពិសោធន៍",
    icon: Heart,
  },
];
